In [5]:
# import pandas as pd
import pandas as pd

In [6]:
#create a dictionary
#that has student name, marks and gender
dict1 = {'Name': ['Neo', 'Thabo', 'Palesa', 'Priyanka','James',
                 'Messi', 'Ronaldo'],
        'Marks': [81,89,92,85,76,98,88],
        'Gender': ['Male','Male','Female','Female','Male','Male','Male']}
#make it into a dataframe
df1 = pd.DataFrame(dict1)
#show the dataframe
df1

       Name  Marks  Gender
0       Neo     81    Male
1     Thabo     89    Male
2    Palesa     92  Female
3  Priyanka     85  Female
4     James     76    Male
5     Messi     98    Male
6   Ronaldo     88    Male

#display the  first 3 rows

In [10]:
df1.head(3)

     Name  Marks  Gender
0     Neo     81    Male
1   Thabo     89    Male
2  Palesa     92  Female

In [11]:
#check last 3 rows
df1.tail(3)

      Name  Marks Gender
4    James     76   Male
5    Messi     98   Male
6  Ronaldo     88   Male

In [13]:
#get the shape of our dataset
df1.shape

(7, 3)

In [14]:
print('Number of rows',df1.shape[0])
print('Number of columns', df1.shape[1])

Number of rows 7
Number of columns 3

In [15]:
#get the information about the dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [17]:
#to check null values 
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
#get overall statistics
df1.describe()

           Marks
count   7.000000
mean   87.000000
std     7.211103
min    76.000000
25%    83.000000
50%    88.000000
75%    90.500000
max    98.000000

In [19]:
df1.describe(include='all')

       Name      Marks Gender
count     7   7.000000      7
unique    7        NaN      2
top     Neo        NaN   Male
freq      1        NaN      5
mean    NaN  87.000000    NaN
std     NaN   7.211103    NaN
min     NaN  76.000000    NaN
25%     NaN  83.000000    NaN
50%     NaN  88.000000    NaN
75%     NaN  90.500000    NaN
max     NaN  98.000000    NaN

In [22]:
#find unique values from the gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [23]:
#find the number of unique values
df1['Gender'].nunique()

2

In [7]:
#count of unique
df1['Gender'].value_counts()

Gender
Male      5
Female    2
Name: count, dtype: int64

In [9]:
#find student with marks between 90 -100
df1[df1['Marks'] >= 90]

     Name  Marks  Gender
2  Palesa     92  Female
5   Messi     98    Male

In [11]:
#another way of doing it but getting the specic number
len(df1[(df1['Marks']>= 90) & (df1['Marks'] <= 100)])

2

In [12]:
#using the bewteen method
sum(df1['Marks'].between(90,100))

2

In [13]:
#find the average marks
df1['Marks'].mean()

87.0

In [18]:
#going to create a function to half the marks
def marks(x):
    return x//2
#add new column
df1['half_marks'] = df1['Marks'].apply(marks)

In [19]:
df1

       Name  Marks  Gender  half_marks
0       Neo     81    Male          40
1     Thabo     89    Male          44
2    Palesa     92  Female          46
3  Priyanka     85  Female          42
4     James     76    Male          38
5     Messi     98    Male          49
6   Ronaldo     88    Male          44

In [21]:
#length of strings in name column
df1['Name'].apply(len)

0    3
1    5
2    6
3    8
4    5
5    5
6    7
Name: Name, dtype: int64

In [23]:
#use the map function to change our dataframe
#by changing male - 0
# and female - 1
#place it into a new column
df1['Male_Female']=df1['Gender'].map({'Male':0, 'Female': 1})

In [24]:
df1

       Name  Marks  Gender  half_marks  Male_Female
0       Neo     81    Male          40            0
1     Thabo     89    Male          44            0
2    Palesa     92  Female          46            1
3  Priyanka     85  Female          42            1
4     James     76    Male          38            0
5     Messi     98    Male          49            0
6   Ronaldo     88    Male          44            0

In [26]:
#drop coloumns
df1.drop(['half_marks', 'Male_Female'], axis=1, inplace=True)
df1

       Name  Marks  Gender
0       Neo     81    Male
1     Thabo     89    Male
2    Palesa     92  Female
3  Priyanka     85  Female
4     James     76    Male
5     Messi     98    Male
6   Ronaldo     88    Male

In [27]:
#print the columns
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [31]:
#sort the dataframe by marks 
df1.sort_values(by=['Marks','Gender'], ascending=False)

       Name  Marks  Gender
5     Messi     98    Male
2    Palesa     92  Female
1     Thabo     89    Male
6   Ronaldo     88    Male
3  Priyanka     85  Female
0       Neo     81    Male
4     James     76    Male

In [33]:
#get the name and marks of the female students
df1[df1['Gender']=='Female'][['Name', 'Marks']]

       Name  Marks
2    Palesa     92
3  Priyanka     85